#+title: Config
#+HUGO_BASE_DIR: ../content
#+HUGO_SECTION: config


** Bare repository

Nixos configs are stored in a bare repository and utilizing config alias to easily interact with the repository.

#+begin_src sh
# Source zsh config.
zsh -c "source ~/.zshrc && which config"
#+end_src

#+RESULTS:
: config: aliased to $HOME/.nix-profile/bin/git --git-dir=$HOME/config --work-tree=$HOME/nixos

